Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.WhileScanningParametersForType
While loading Type '[Name]', parameter '[Name]': [Description]

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.WhileLoadingFamilyShared
While loading shared family '[Family Name]' from family '[Family Name]': [Description]

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.WhileLoadingFamily
While loading family '[Family Name]': [Description]

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ValueOutOfRange
The value must be from 0.0 to 1.0

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnexpectedFamilyChangeResultsWarning
Changing the family for a MEP fitting might cause unexpected results.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnexpectedFamilyChangeResultsError
Changing the family for a MEP fitting might cause unexpected results.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnableToUpgradeDueToCorruptFamilies
Some families have become unusable. Reload the families, or delete them from the model.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnableGenerateTrussByFamilyAndOrientation
Revit is unable to generate a truss using the current Layout Family and Truss orientation.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.TypeRecursiveElementIdParameter
Type's parameter cannot recursively point to the type itself.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.TryingToAttachWhenJoined
The column and target are joined. The attachment has been removed.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.TitleblockBadViewType
Titleblocks can only be placed on sheets.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.StructuralColumnAttachedToNonStructuralTarget
The structural column is attached to a non-structural target.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SlantedColumnEndPlanesHaveFlipped
Position of end cut planes has resulted in a slanted column without any geometry.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SlantedColumnEndCutPlaneIsParallelToGeometry
Cut plane of slanted column end is parallel to the location curve.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SketchCannotBeAutomaticallyDimensioned
Sketch can't be Automatically Dimensioned - this is a prerequisite for Labeled Dimensions to work properly.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SizeLookupTableIsNotAvailableForType
Size Lookup Table is not available for type [Family Symbol].

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SharedParameterReplacedByBuiltInOne
Shared parameter [Name] will be replaced by a built-in parameter with the same name. This may affect scheduling!

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SetbackTooLarge
Setback computations are too large for this element.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ReferencePlanesOverconstrained
Reference Planes are overconstrained.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ProfileContainsNoLoops
Profile type '[Family Symbol]' contains no loops.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.NotFamilyFile
The selected file is not a Family File.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.NonGenericAnnotationsOutsideLegend
Only Generic Annotations may be copied between Legends and other Views

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.NoInstparamFormulas
Instance Parameters can't be used in Type Parameter formulas.\n\n[Description]

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.MightntPlaceInsertsWarning
There exist geometry collision. These elements might not be copied.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidSlantedColumnOffsetsInNestedFamily
Instance of family [Family Name] can't be updated because in nested family the column's base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidSlantedColumnOffsets
The column's base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidParameterValue
Parameter [Caption] has an invalid value.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidFormularFoundInParameter
Invalid formular found in parameter '[Param Name]' in type '[Type Name]'.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidFamilyType
Invalid family type "[Type Name]".

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidContextForAdaptivePlacement
The component '%1!s!' cannot be directly placed in the project environment. Place it in either an In-Place Mass, a Conceptual Mass Family, a Curtain Panel by Pattern Family, or an Adaptive Component.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InstOutsideFaceBoundary
Instance origin does not lie on host face. Instance will lose association to host.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InstMayCutMoreOrFewerHosts
Insert may be cutting fewer or more hosts than needed. The problem may be solved by forcing regeneration, e.g. by moving the insert out and back by a tiny distance in any direction.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.HighlightedElementFamRefsInvalidWarning
One or more references of the highlighted element have become invalid.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.HighlightedElementFamRefsInvalidError
One or more references of the highlighted element have become invalid.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FrozenBecauseMonitorRelationshipGone
The position of this element was determined by copy/monitor but the monitor relationship has been removed.  To move this instance, use pick new host to select a valid host.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FrozenBecauseFaceGone
This family instance was hosted by a curved face that is no longer present in the linked file.  To move the family instance, rehost it.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FormulasFailedForType
"Can't satisfy formulas for type [Family Symbol].

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FormulaBasedParameterCannotBeChanged
Parameter '[Caption]' cannot be changed because it is defined by formula '[Formula]'

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyValidationResult
Family Validation Warning(s): [Description]

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyParameterNoExist
The parameter [Name] doesn't exist in the Family. It will be ignored.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyOverconstraintCB
Dimension overconstrains the Family.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyOverconstraint
Dimension overconstrains the Family.
Cannot set Family Type to <None>.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyNotFitHostShape
The host shape has changed and the family is no longer appropriate.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyNoExternalParametersWarning
Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyNoExternalParametersError
Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyMembersReferToOutsideFamily
Memebrs of Family '[Name]' or a nested family thereof illegally refer to Elements outside the family.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyIsCorruptWarning
Some families have become unusable. Reload the families, or delete them from the model.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyIsCorruptError
Some families have become unusable. Reload the families, or delete them from the model.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyDoesntMatchSystemPropertiesDisconnected
The family no longer matches the properties for the System. Disconnect the family from the System?

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyConnectorDeletedWarning
The family Connector has been modified so the connection is invalid.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyConnectorDeletedError
The family Connector has been modified so the connection is invalid.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyCannotBeUpgraded
"Family '[Name]' cannot be upgraded and must be deleted.  To fix the file in the older version of Revit, try loading newer versions of these families: [Names]."

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyBadUnattachedVoids
Family '[Family Name]' contains unattached voids that can't be combined for cutting.  Try fixing the voids or unset the Cut with Voids parameter in the family.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FailedWhenLoadingFamily
Some unlocked labeled dimensions prevent family from loading. Please try to lock unlocked labeled dimensions and load again.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FailedToSetParameters
Failed to apply family parameters.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FailedToBecomeNonParametric
Family failed to become non-parametric!

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ElementTypeParameterized
The type(s) of the selected element(s) are driven by family parameter(s). Changing the type directly will break the association.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DuplicateTypeName
"Ignoring attempt to add family type '%1!s!' for a second time."

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DuplicateParamName
Family parameters have duplicate names.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DuplicateFamilyParameterNameWithSharedParameter
Parameter '[Parameter]' has the same name with an existing shared parameter.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DummyHostMustBePerpendicularToXY
Dummy host must be perpendicular to Z or Y axis.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamTypeDumped
Can't make type "[Family Name]".  It will be deleted.  Failing family has been saved to "[File Name]"

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamType
Can't make type "[Family Name]".  It will be deleted.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamElemError
Family contains invalid elements.  They will be deleted.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamElemCorruption
Family contains invalid elements.  They will be deleted.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CustomFittingCreated
Custom fitting was created.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CouldNotPlaceAdaptiveFamInst
Could not place Adaptive Family Instance.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CouldNotGenerateReferencesForFamilyInstance
Could not generate references for Family Instance.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ContainsSharedSameNameFamily
Family '[Family Name]' contains a shared family of the same name. Please rename one of the two families before loading!

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnTooLong
This column is too long. Maximum length is 30,000 ft.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnHeightZeroBecauseOfInvalidOffset
Change Offset Value so that Column height is not 0.0.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnAndTargetAlreadyJoined
The column and target are joined, remove that join before attaching them.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnAlreadyAttachedWillBeReattached
The column is already attached. It will be detached and attached to the new target.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CircularRefsForInstParams
"Instance parameter '%1!s!' generates circular references."

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantSolve
Can't find solution for formulas for Type '[Type Name]'.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantSetSlantedColumnEndPlane
Unable to determine slanted column end cut plane.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceInstanceWarning
Can't place instance of [Symbol]

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceInstanceError
Can't place instance of [Symbol]

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceInsertsWarning
Can't place inserts outside of hosts. These elements won't be copied.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceInsertsError
Can't place inserts outside of hosts. These elements won't be copied.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceATOnDuctError
The air terminal cannot be placed in an elevation or section view unless it is attached to a duct.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPasteSelection
Can't paste selection.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantMoveFrozenInstance
A family instance placed on a curved surface of a linked file can't be moved while the link is unloaded.  To move the instance, reload the link or rehost the instance.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantMirrorInstWoHost
Can't mirror an instance without its host.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantEditWhileGrouped
You may not edit this parameter while the element is grouped.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantCopySelectionToNonStory
Can't copy this selection to a non-story Level.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotUnlockFamilyTemplate
Can't unlock alignments from Family Template.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotSetFamilyTypeToNone
Cannot set Family Type to 'None';.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotRotateElement
Can't rotate element into this position.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotRegenerateCorruptFamily
Family [Family Name] is corrupt and its instances cannot be updated. Please reload the family to repair the project..

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotPasteObject
Can't paste some or all of the selected objects.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotPasteLabelsAcrossFamilies
Can't paste Labels across Families of different Categories.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotMakeTypeFamilySaved
Can't make type "[Family Name]".  Failing family has been saved to "[File Name]"

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotMakeTypeCB
Can't make type "[Family Name]".

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotLoadMetricFamilyToImperialProject
Can't load a metric Family into an imperial Project.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotLoadImperialFamilyToMetricProject
Can't load an imperial Family into a metric Project.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotFindHost
Couldn't find an appropriate Host.  Try selecting a different Host Face or switch Placement Mode.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotCutRefPlane
Can't cut reference plane.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotCopyInplaceFamily
In-place family groups cannot be copied between in-place families of the same project.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotCopyByPatternFamilies
Can't copy between Mass or Curtain Panel by Pattern families, and other families or Revit projects.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotConvertInstWorkPlaneToHost
Can't convert Instance's Work Plane to Host.  Try resetting Work Plane to a Level.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotConvertInstHostToWorkPlane
Can't convert Instance's Host to Work Plane.  Try resetting Host to a Level.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotChangeInstFam
Can't change Instance's Family.  Try changing Instance's Host to a Level first.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotChangeCategory
Can't change category of Family Instance

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotAddParameterToFamily
Parameter '[Parameter]' cannot be added to the family.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures
Failures related to families.